// lib/descriptions.js
export const skillDescriptions = {
    은신: `
        2턴간 은신 상태가 되어 회피율이 증가하고,<br />
        은신 중 공격 시 방어력 관통 증가, 추가 피해를 입히고<br />
        확률적으로 출혈 상태이상을 부여합니다.
    `,
    강타: `
        다음 공격에 반드시 치명타가 적용되는 공격을 가하며,<br />
        해당 공격의 치명타 피해량과 공격력이 증가합니다.
    `,
    창격: `
        거리에 따라 효과가 달라집니다.<br />
        근접 시 상대를 밀쳐내고,<br />
        적정 거리에서는 치명타 및 명중 보너스를 받습니다.<br />
    `,
    수확: `
        상대에게 스킬 피해를 입히고,<br />
        가한 피해량의 일정 비율만큼 자신의 내구도를 회복합니다.
    `,
    속사: `
        스피드에 비례하여 여러 번 공격합니다.<br />
        마지막 일격은 강화되어 더 큰 피해를 입힙니다
    `
    ,
    헤드샷: `
        상대에게 스킬 피해를 입힙니다.<br />
        치명타 확률에 따라 피해량이 증가합니다.<br />
        사용 후 '장전' 상태가 됩니다.
    `
  };